MathLogic/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-08-07 Mon 11:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Discrete Math + Logic</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
<meta name="description" content="On Assertions in Software Engineering"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Discrete Math + Logic</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org84e0ce6">1. Overview</a></li>
<li><a href="#orgb0083b6">2. Discrete Math</a></li>
<li><a href="#org254d97a">3. Mathematical Logic</a>
<ul>
<li><a href="#orgbfc774d">3.1. Weaker/Stronger Predicates</a></li>
<li><a href="#org02737a8">3.2. A Model for a WFF</a></li>
</ul>
</li>
<li><a href="#orgd1a751f">4. Temporal Logic</a></li>
<li><a href="#orgb8c49b7">5. References</a></li>
<li><a href="#org5d7fc47">6. End</a></li>
</ul>
</div>
</div>
<p>
Landing page for Discrete Math + Logic
</p>

<div id="outline-container-org84e0ce6" class="outline-2">
<h2 id="org84e0ce6"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Assertions: Formal or Informal</li>
<li>Informally stated assertions: Carefully written, but in English.</li>
<li>Formally stated assertions: Discrete Math + Mathematical Logic</li>
<li>Our treatment is in support of Automated Proofs of Assertions</li>
</ol>
</div>
</div>

<div id="outline-container-orgb0083b6" class="outline-2">
<h2 id="orgb0083b6"><span class="section-number-2">2</span> Discrete Math</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Sets, Sequences, Bags, Tables</li>
<li>Trees: n-ary, (spatially) ordered trees, traversals, subtrees, forests</li>
<li>Undirected and directed graphs, connected components</li>
</ol>
</div>
</div>

<div id="outline-container-org254d97a" class="outline-2">
<h2 id="org254d97a"><span class="section-number-2">3</span> Mathematical Logic</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Propositional calculus</li>
<li>Predicate calculus</li>
<li>Higher Order Logic</li>
</ol>
</div>

<div id="outline-container-orgbfc774d" class="outline-3">
<h3 id="orgbfc774d"><span class="section-number-3">3.1</span> Weaker/Stronger Predicates</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>Simple example: x &gt; 7 implies x &gt; 1.</li>
<li>Consider: P implies Q (also written as P ⇒ Q). We say that P is
<i>stronger</i> than Q. Alt: Q is <i>weaker</i> than P.</li>
</ol>
</div>
</div>

<div id="outline-container-org02737a8" class="outline-3">
<h3 id="org02737a8"><span class="section-number-3">3.2</span> A Model for a WFF</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li>Well-formed-formulae P and Q, in general, have free variables, x,
y, z, &#x2026; Consider a particular assignment A of values for each of
x, y, z that makes P come out True. A will also make Q True.</li>

<li>In the context of programming, we can refer to this A as a "state".
In logic, this is known as a model.</li>

<li>Let C(Q) be the collection of such assignments that make Q come out
as True.  Similarly, C(P).</li>

<li>Then, C(P) is a subset of C(Q), if and when P is stronger than Q.</li>

<li>If C(P) = C(Q), P is equivalent to Q (also written as P ⇔ Q, or P ≡
Q).</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgd1a751f" class="outline-2">
<h2 id="orgd1a751f"><span class="section-number-2">4</span> Temporal Logic</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="../TemporalLogic/index.html">../TemporalLogic/index.html</a></li>
</ol>
</div>
</div>

<div id="outline-container-orgb8c49b7" class="outline-2">
<h2 id="orgb8c49b7"><span class="section-number-2">5</span> References</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>MIT book, free PDF</li>
<li>Lesliee Lamport, free PDF</li>
</ol>
</div>
</div>

<div id="outline-container-org5d7fc47" class="outline-2">
<h2 id="org5d7fc47"><span class="section-number-2">6</span> End</h2>
<div class="outline-text-2" id="text-6">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2017 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2017-06-10
</div>
</body>
</html>
